app/controllers/admin/artists_controller.rb

  def index
    @artist = Artist.all
---
SELECT "artists".* FROM "artists"

  def edit
    @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

   def update
    artist = Artist.find(params[:id])
    artist.update(artist_params)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "artists" SET "artist_image_id" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["artist_image_id", "fcbf107e921782c20de988fcdfe32877854d511ffe34b7158690cef4b3d9"], ["updated_at", "2019-09-12 12:21:10.718279"], ["id", 3]]

  def create
    @artist_new = Artist.new(artist_params)
    @artist_new.save
---
INSERT INTO "artists" ("artist_name", "artist_image_id", "artist_introduction", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def destroy
    artist = Artist.find(params[:id])
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]