app/controllers/admin/discs_controller.rb

  def destroy
    @disc = Disc.find(params[:id])
    @product = @disc.product
    if @disc.destroy
---
SELECT  "discs".* FROM "discs" WHERE "discs"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]
DELETE FROM "discs" WHERE "discs"."id" = ?  [["id", 27]]