app/controllers/admin/inquiries_controller.rb

SELECT  "inquiries".* FROM "inquiries" ORDER BY "inquiries"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "inquiries"
---
  def index
  	@inquiry = Inquiry.page(params[:page]).reverse_order.per(5)

SELECT  "inquiries".* FROM "inquiries" WHERE "inquiries"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
  	@inquiry = Inquiry.find(params[:id])