app/controllers/admin/products_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "discs".* FROM "discs" WHERE "discs"."product_id" = ? AND "discs"."id" IN (?, ?)  [["product_id", 1], ["id", 2], ["id", 3]]
SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ? AND "songs"."id" IN (?, ?)  [["disc_id", 2], ["id", 2], ["id", 3]]
---
  def show
    @product = Product.find(params[:id])
    @discs = @product.discs.includes(:songs)
    @artist = @product.artist
    @genre = @product.genre
    @label = @product.label
    @arrival_new = Arrival.new
    @disposal_new = Disposal.new
    #在庫数計算
      # 入荷数計算
      arrivals = @product.arrivals
      @arrival = arrivals.all.sum(:received_qty)
      # 廃棄数計算
      disposal = @product.disposals
      @disposal = disposal.all.sum(:scrapped_qty)
      # 注文数計算
      order_content = @product.order_contents
      @order_content = order_content.all.sum(:product_qty)
      @stock = @arrival - @disposal - @order_content
      @reviews = @product.reviews.page(params[:page]).reverse_order.per(5)