app/controllers/admin/products_controller.rb

INSERT INTO "products" ("genre_id", "artist_id", "product_name", "price", "label_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["genre_id", 1], ["artist_id", 1], ["product_name", "testtest"], ["price", 2000], ["label_id", 1], ["created_at", "2019-09-12 03:43:41.430139"], ["updated_at", "2019-09-12 03:43:41.430139"]]
---
  def create
    @product = Product.new(product_params)
      if @product.save

UPDATE "products" SET "jacket_image_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["jacket_image_id", "1d5f3ad5d825e8728705d2679716ee963c461be70768b4f42ef995ae5f77"], ["updated_at", "2019-09-12 16:53:22.826624"], ["id", 22]]
---
  def update
    @product = Product.find(params[:id])
      if @product.update(product_params)