app/controllers/admin/products_controller.rb

  def index
    @products = Product.includes([:artist, :genre]).page(params[:page]).reverse_order.per(20)
---
SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"

  def show
    @product = Product.find(params[:id])
    @discs = @product.discs.includes(:songs)
    @artist = @product.artist
    @genre = @product.genre
    @label = @product.label
    @arrival_new = Arrival.new
    @disposal_new = Disposal.new
    arrivals = @product.arrivals
    @arrival = arrivals.all.sum(:received_qty)
    disposal = @product.disposals
    @disposal = disposal.all.sum(:scrapped_qty)
    order_content = @product.order_contents
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" IN (?, ?)  [["disc_id", 2], ["disc_id", 3]]
SELECT "discs".* FROM "discs" WHERE "discs"."product_id" = ?  [["product_id", 22]]
SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" = ? AND "songs"."id" IN (?, ?)  [["disc_id", 2], ["id", 2], ["id", 3]]
SELECT "discs".* FROM "discs" WHERE "discs"."product_id" = ?  [["product_id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @product_new = Product.new
    @disc = @product_new.discs.build
    @song = @disc.songs.build

    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)
      if @product.save
---
INSERT INTO "products" ("genre_id", "artist_id", "product_name", "price", "label_id", "jacket_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @product = Product.find(params[:id])
      if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "product_name" = ?, "jacket_image_id" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product_name", "CD1rrrrrrrrrrrr"], ["jacket_image_id", nil], ["updated_at", "2019-09-12 11:51:54.985886"], ["id", 1]]