app/controllers/admin/replies_controller.rb

INSERT INTO "replies" ("inquiry_id", "reply_content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["inquiry_id", 1], ["reply_content", "a"], ["created_at", "2019-09-15 05:21:49.305604"], ["updated_at", "2019-09-15 05:21:49.305604"]]
---
	def create
		@reply = Reply.new(reply_params)
		@reply.save