app/controllers/admin/songs_controller.rb

  def destroy
    @song = Song.find(params[:id])
    @disc = @song.disc
    @product = @disc.product
    if @song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 40]]