app/views/admin/products/edit.html.erb

SELECT "artists".* FROM "artists"
---
        <%= f.label "アーティスト名を選択" %>
        <%= f.collection_select(:artist_id, Artist.all, :id, :artist_name) %>

SELECT "labels".* FROM "labels"
---
        <%= f.label "レーベルを選択" %>
        <%= f.collection_select(:label_id, Label.all, :id, :label_name) %>

SELECT "genres".* FROM "genres"
---
        <%= f.label "ジャンルを選択" %>
        <%= f.collection_select(:genre_id, Genre.all, :id, :genre_name) %>