app/views/admin/products/new.html.erb

        <%= f.label "アーティスト名を選択" %>
        <%= f.collection_select(:artist_id, Artist.all, :id, :artist_name, prompt: "アーティストを選択して下さい") %>
---
SELECT "artists".* FROM "artists"

        <%= f.label "レーベルを選択" %>
        <%= f.collection_select(:label_id, Label.all, :id, :label_name, prompt: "レーベルを選択して下さい") %>
---
SELECT "labels".* FROM "labels"

        <%= f.label "ジャンルを選択" %>
        <%= f.collection_select(:genre_id, Genre.all, :id, :genre_name, prompt: "ジャンルを選択して下さい") %>
---
SELECT "genres".* FROM "genres"