app/views/admin/products/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" IN (?, ?)  [["disc_id", 24], ["disc_id", 25]]
---
                <!== 収録曲の処理 ==>
                <% disc.songs.each do |song|%>