app/controllers/end_users_controller.rb

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@end_user = EndUser.find(params[:id])