app/controllers/inquiries_controller.rb

SELECT  "end_users".* FROM "end_users" WHERE "end_users"."id" = ? ORDER BY "end_users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
  	@inquiry = Inquiry.new
    @user = EndUser.find(current_end_user.id)

INSERT INTO "inquiries" ("inquirer_name", "mail", "inquiry_content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["inquirer_name", "よしみ天童"], ["mail", "afdfdfdfgvsda@gmail.com"], ["inquiry_content", "私のCDも売りなさい"], ["created_at", "2019-09-16 06:18:22.386798"], ["updated_at", "2019-09-16 06:18:22.386798"]]
---
  def create
  	inquiry = Inquiry.new(inquiry_params)
  	inquiry.save