app/controllers/products_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.includes([:artist, :genre]).page(params[:page]).reverse_order.per(20)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "discs".* FROM "discs" WHERE "discs"."product_id" = ?  [["product_id", 21]]
SELECT "songs".* FROM "songs" WHERE "songs"."disc_id" IN (?, ?)  [["disc_id", 24], ["disc_id", 25]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product = Product.find(params[:id])
    @discs = @product.discs.includes(:songs)
    @artist = @product.artist
    @genre = @product.genre
    @label = @product.label
    @cart = Cart.new
    #在庫数計算
    arrivals = @product.arrivals
    @arrival = arrivals.all.sum(:received_qty)
    disposal = @product.disposals
    @disposal = disposal.all.sum(:scrapped_qty)
    order_content = @product.order_contents